     A*  D0426P - PROBE ONLY (not shipped). Conditioning indicators in
     A*  cols 8-10 (N in col 8, indicator in cols 9-10) as in the ILE
     A*  RPG Programmer's Guide (SFLCLR/SFLDSP/SFLEND examples).
     A                                      DSPSIZ(24 80 *DS3)
     A          R SFL1                      SFL
     A            TOKCD          6A  O  4  2
     A            TOKNM         30A  O  4 10
     A          R SFL1CTL                   SFLCTL(SFL1)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(14)
     A  70                                  SFLCLR
     A N70                                  SFLDSPCTL
     A  71                                  SFLDSP
     A  72                                  SFLEND(*MORE)
     A                                      CF03(03)
     A                                  1  2'D0426P - indicator probe'
     A                                  3  2'Code'
     A                                  3 10'Name'
