      * V24NB - NEGATIVE: RETRN is an RPG III opcode, not RPG IV (RETURN).
     H DFTACTGRP(*YES)
     DFLG              S              1A
     DQTY              S              5P 0
     C     *ENTRY        PLIST
     C                   PARM                    QTY
     C                   PARM                    FLG
     C                   SETON                                        LR
     C                   RETRN
