      * V24NA - NEGATIVE: PARM names a field that is not defined anywhere.
     H DFTACTGRP(*YES)
     DFLG              S              1A
     C     *ENTRY        PLIST
     C                   PARM                    QTY
     C                   PARM                    FLG
     C                   SETON                                        LR
     C                   RETURN
