     A*  D0426E - D0426B + record count CNT (exercise 4 answer).
     A*  No DDS conditioning indicators (see docs/probes.md).
     A                                      DSPSIZ(24 80 *DS3)
     A          R SFL1                      SFL
     A            TOKCD          6A  O  4  2
     A            TOKNM         30A  O  4 10
     A          R SFL1CTL                   SFLCTL(SFL1)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(14)
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A                                      CF03(03)
     A                                      OVERLAY
     A                                  1  2'D0426E - Customer list (TOKUIM)'
     A                                  3  2'Code'
     A                                  3 10'Name'
     A          R SFL1FTR
     A                                      OVERLAY
     A            MORE          10A  O 20  2
     A                                 21  2'Count:'
     A            CNT            4S 0O 21  9
     A                                 23  2'F3=Exit  Roll=Page'
