     A*  D0426D - D0426B + sales rep column TOKTAN (exercise 3 answer).
     A*  No DDS conditioning indicators (see docs/probes.md).
     A                                      DSPSIZ(24 80 *DS3)
     A          R SFL1                      SFL
     A            TOKCD          6A  O  4  2
     A            TOKNM         30A  O  4 10
     A            TOKTAN         6A  O  4 42
     A          R SFL1CTL                   SFLCTL(SFL1)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(14)
     A                                      SFLDSP
     A                                      SFLDSPCTL
     A                                      CF03(03)
     A                                      OVERLAY
     A                                  1  2'D0426D - Customer list (TOKUIM)'
     A                                  3  2'Code'
     A                                  3 10'Name'
     A                                  3 42'Rep'
     A          R SFL1FTR
     A                                      OVERLAY
     A            MORE          10A  O 20  2
     A                                 23  2'F3=Exit  Roll=Page'
