      * R0408BA - called side: look up a customer name by code.
      * PARM 1 PCODE 6 in, PARM 2 PNAME 30 out, PARM 3 PRC 1,0 out
      * (0 = found, 1 = not found).
     H
     FTOKUIM  I   E           K        DISK
     C           *ENTRY    PLIST
     C                     PARM           PCODE   6
     C                     PARM           PNAME  30
     C                     PARM           PRC     10
     C                     MOVE *BLANKS   PNAME
     C           PCODE     CHAINTOKUIM               99
     C   99                MOVEL'NOTFOUND'PNAME
     C   99                Z-ADD1         PRC
     C  N99                MOVELTOKNM     PNAME
     C  N99                Z-ADD0         PRC
     C                     SETON                     LR
     C                     RETRN
