      * R0408A - JUCINQ3: order inquiry report for one customer.
     H
     FTOKUIM  IF  E           K        DISK
     FJUCHUM  IF  E                    DISK
     FQSYSPRT O   F     132            PRINTER
     C                     MOVEL'C00001'  CUST    6
     C           CUST      CHAINTOKUIM               99
     C   99                MOVEL'NOTFOUND'TOKNM
     C           LOOP      TAG
     C                     READ JUCHUM                   98
     C   98                GOTO ENDLP
     C           JUTOK     IFEQ CUST
     C                     EXCPT
     C                     ENDIF
     C                     GOTO LOOP
     C           ENDLP     TAG
     C                     SETON                     LR
     OQSYSPRT E
     O                         TOKNM     30
     O                                   32 '  '
     O                         JUNO      38
     O                                   40 '  '
     O                         JUDATE    48
