             PGM
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             CHGVAR     VAR(&LIB) VALUE('QSYS')
             DSPLIB     LIB(&LIB)
             ENDPGM
